Tekla Open API Reference for Tekla Structures 2025
Brep Constructor
Overload List
Name | Description
Brep()
 Initializes a new instance of the Brep class. The start and end points are in the origin.
Brep(Point, Point)
 Initializes a new instance of the Brep class with the given start and end points.
Top
See Also
Reference
Brep Class
Tekla.Structures.Model Namespace